# GetBoundaries Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GenericZone..::..GetBoundaries Method
GenericZone Class See Also
---
Gets the boundaries for the generic zone.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public IList<CurveLoop> GetBoundaries()
```

Visual Basic
---
```text
Public Function GetBoundaries As IList(Of CurveLoop)
```

Visual C++
---
```text
public:
IList<CurveLoop^>^ GetBoundaries()
```

# ### Return Value
The generic zone boundaries.
# See Also
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace